evidence/02-incident-replay/OPS-2201-k6-output.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: load-tests/reproduce-OPS-2201.js
        output: -

     scenarios: (100.00%) 1 scenario, 200 max VUs, 1m0s max duration (incl. graceful stop):
              * shift_change_search: 200 looping VUs for 30s (gracefulStop: 30s)


running (0m01.0s), 200/200 VUs, 783 complete and 0 interrupted iterations
shift_change_search   [   3% ] 200 VUs  01.0s/30s

running (0m02.0s), 200/200 VUs, 1903 complete and 0 interrupted iterations
shift_change_search   [   7% ] 200 VUs  02.0s/30s

running (0m03.0s), 200/200 VUs, 3129 complete and 0 interrupted iterations
shift_change_search   [  10% ] 200 VUs  03.0s/30s

running (0m04.0s), 200/200 VUs, 4379 complete and 0 interrupted iterations
shift_change_search   [  13% ] 200 VUs  04.0s/30s

running (0m05.0s), 200/200 VUs, 5604 complete and 0 interrupted iterations
shift_change_search   [  17% ] 200 VUs  05.0s/30s

running (0m06.0s), 200/200 VUs, 6828 complete and 0 interrupted iterations
shift_change_search   [  20% ] 200 VUs  06.0s/30s

running (0m07.0s), 200/200 VUs, 8131 complete and 0 interrupted iterations
shift_change_search   [  23% ] 200 VUs  07.0s/30s

running (0m08.0s), 200/200 VUs, 9433 complete and 0 interrupted iterations
shift_change_search   [  27% ] 200 VUs  08.0s/30s

running (0m09.0s), 200/200 VUs, 10732 complete and 0 interrupted iterations
shift_change_search   [  30% ] 200 VUs  09.0s/30s

running (0m10.0s), 200/200 VUs, 12022 complete and 0 interrupted iterations
shift_change_search   [  33% ] 200 VUs  10.0s/30s

running (0m11.0s), 200/200 VUs, 13308 complete and 0 interrupted iterations
shift_change_search   [  37% ] 200 VUs  11.0s/30s

running (0m12.0s), 200/200 VUs, 14602 complete and 0 interrupted iterations
shift_change_search   [  40% ] 200 VUs  12.0s/30s

running (0m13.0s), 200/200 VUs, 15914 complete and 0 interrupted iterations
shift_change_search   [  43% ] 200 VUs  13.0s/30s

running (0m14.0s), 200/200 VUs, 17180 complete and 0 interrupted iterations
shift_change_search   [  47% ] 200 VUs  14.0s/30s

running (0m15.0s), 200/200 VUs, 18468 complete and 0 interrupted iterations
shift_change_search   [  50% ] 200 VUs  15.0s/30s

running (0m16.0s), 200/200 VUs, 19746 complete and 0 interrupted iterations
shift_change_search   [  53% ] 200 VUs  16.0s/30s

running (0m17.0s), 200/200 VUs, 21028 complete and 0 interrupted iterations
shift_change_search   [  57% ] 200 VUs  17.0s/30s

running (0m18.0s), 200/200 VUs, 22335 complete and 0 interrupted iterations
shift_change_search   [  60% ] 200 VUs  18.0s/30s

running (0m19.0s), 200/200 VUs, 23599 complete and 0 interrupted iterations
shift_change_search   [  63% ] 200 VUs  19.0s/30s

running (0m20.0s), 200/200 VUs, 24871 complete and 0 interrupted iterations
shift_change_search   [  67% ] 200 VUs  20.0s/30s

running (0m21.0s), 200/200 VUs, 26128 complete and 0 interrupted iterations
shift_change_search   [  70% ] 200 VUs  21.0s/30s

running (0m22.0s), 200/200 VUs, 27404 complete and 0 interrupted iterations
shift_change_search   [  73% ] 200 VUs  22.0s/30s

running (0m23.0s), 200/200 VUs, 28686 complete and 0 interrupted iterations
shift_change_search   [  77% ] 200 VUs  23.0s/30s

running (0m24.0s), 200/200 VUs, 29852 complete and 0 interrupted iterations
shift_change_search   [  80% ] 200 VUs  24.0s/30s

running (0m25.0s), 200/200 VUs, 31144 complete and 0 interrupted iterations
shift_change_search   [  83% ] 200 VUs  25.0s/30s

running (0m26.0s), 200/200 VUs, 32408 complete and 0 interrupted iterations
shift_change_search   [  87% ] 200 VUs  26.0s/30s

running (0m27.0s), 200/200 VUs, 33704 complete and 0 interrupted iterations
shift_change_search   [  90% ] 200 VUs  27.0s/30s

running (0m28.0s), 200/200 VUs, 34990 complete and 0 interrupted iterations
shift_change_search   [  93% ] 200 VUs  28.0s/30s

running (0m29.0s), 200/200 VUs, 36278 complete and 0 interrupted iterations
shift_change_search   [  97% ] 200 VUs  29.0s/30s

running (0m30.0s), 200/200 VUs, 37570 complete and 0 interrupted iterations
shift_change_search   [ 100% ] 200 VUs  30.0s/30s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<300' p(95)=163.79ms


  █ TOTAL RESULTS 

    checks_total.......: 37794   1253.875641/s
    checks_succeeded...: 100.00% 37794 out of 37794
    checks_failed......: 0.00%   0 out of 37794

    ✓ status is 200

    HTTP
    http_req_duration..............: avg=158.96ms min=14.23ms med=154.07ms max=6.44s p(90)=161.38ms p(95)=163.79ms
      { expected_response:true }...: avg=158.96ms min=14.23ms med=154.07ms max=6.44s p(90)=161.38ms p(95)=163.79ms
    http_req_failed................: 0.00%  0 out of 37794
    http_reqs......................: 37794  1253.875641/s

    EXECUTION
    iteration_duration.............: avg=159.1ms  min=14.3ms  med=154.14ms max=6.46s p(90)=161.45ms p(95)=163.86ms
    iterations.....................: 37794  1253.875641/s
    vus............................: 200    min=200        max=200
    vus_max........................: 200    min=200        max=200

    NETWORK
    data_received..................: 700 MB 23 MB/s
    data_sent......................: 3.9 MB 130 kB/s



running (0m30.1s), 000/200 VUs, 37794 complete and 0 interrupted iterations
shift_change_search ✓ [ 100% ] 200 VUs  30s