evidence/02-incident-replay/OPS-2201-repro-k6-output.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: load-tests/reproduce-OPS-2201.js
        output: -

     scenarios: (100.00%) 1 scenario, 200 max VUs, 1m0s max duration (incl. graceful stop):
              * shift_change_search: 200 looping VUs for 30s (gracefulStop: 30s)


running (0m01.0s), 200/200 VUs, 14 complete and 0 interrupted iterations
shift_change_search   [   3% ] 200 VUs  01.0s/30s

running (0m02.0s), 200/200 VUs, 29 complete and 0 interrupted iterations
shift_change_search   [   7% ] 200 VUs  02.0s/30s

running (0m03.0s), 200/200 VUs, 45 complete and 0 interrupted iterations
shift_change_search   [  10% ] 200 VUs  03.0s/30s

running (0m04.0s), 200/200 VUs, 60 complete and 0 interrupted iterations
shift_change_search   [  13% ] 200 VUs  04.0s/30s

running (0m05.0s), 200/200 VUs, 78 complete and 0 interrupted iterations
shift_change_search   [  17% ] 200 VUs  05.0s/30s

running (0m06.0s), 200/200 VUs, 94 complete and 0 interrupted iterations
shift_change_search   [  20% ] 200 VUs  06.0s/30s

running (0m07.0s), 200/200 VUs, 110 complete and 0 interrupted iterations
shift_change_search   [  23% ] 200 VUs  07.0s/30s

running (0m08.0s), 200/200 VUs, 126 complete and 0 interrupted iterations
shift_change_search   [  27% ] 200 VUs  08.0s/30s

running (0m09.0s), 200/200 VUs, 141 complete and 0 interrupted iterations
shift_change_search   [  30% ] 200 VUs  09.0s/30s

running (0m10.0s), 200/200 VUs, 159 complete and 0 interrupted iterations
shift_change_search   [  33% ] 200 VUs  10.0s/30s

running (0m11.0s), 200/200 VUs, 176 complete and 0 interrupted iterations
shift_change_search   [  37% ] 200 VUs  11.0s/30s

running (0m12.0s), 200/200 VUs, 190 complete and 0 interrupted iterations
shift_change_search   [  40% ] 200 VUs  12.0s/30s

running (0m13.0s), 200/200 VUs, 206 complete and 0 interrupted iterations
shift_change_search   [  43% ] 200 VUs  13.0s/30s

running (0m14.0s), 200/200 VUs, 223 complete and 0 interrupted iterations
shift_change_search   [  47% ] 200 VUs  14.0s/30s

running (0m15.0s), 200/200 VUs, 239 complete and 0 interrupted iterations
shift_change_search   [  50% ] 200 VUs  15.0s/30s

running (0m16.0s), 200/200 VUs, 254 complete and 0 interrupted iterations
shift_change_search   [  53% ] 200 VUs  16.0s/30s

running (0m17.0s), 200/200 VUs, 270 complete and 0 interrupted iterations
shift_change_search   [  57% ] 200 VUs  17.0s/30s

running (0m18.0s), 200/200 VUs, 286 complete and 0 interrupted iterations
shift_change_search   [  60% ] 200 VUs  18.0s/30s

running (0m19.0s), 200/200 VUs, 302 complete and 0 interrupted iterations
shift_change_search   [  63% ] 200 VUs  19.0s/30s

running (0m20.0s), 200/200 VUs, 318 complete and 0 interrupted iterations
shift_change_search   [  67% ] 200 VUs  20.0s/30s

running (0m21.0s), 200/200 VUs, 332 complete and 0 interrupted iterations
shift_change_search   [  70% ] 200 VUs  21.0s/30s

running (0m22.0s), 200/200 VUs, 349 complete and 0 interrupted iterations
shift_change_search   [  73% ] 200 VUs  22.0s/30s

running (0m23.0s), 200/200 VUs, 364 complete and 0 interrupted iterations
shift_change_search   [  77% ] 200 VUs  23.0s/30s

running (0m24.0s), 200/200 VUs, 381 complete and 0 interrupted iterations
shift_change_search   [  80% ] 200 VUs  24.0s/30s

running (0m25.0s), 200/200 VUs, 396 complete and 0 interrupted iterations
shift_change_search   [  83% ] 200 VUs  25.0s/30s

running (0m26.0s), 200/200 VUs, 412 complete and 0 interrupted iterations
shift_change_search   [  87% ] 200 VUs  26.0s/30s

running (0m27.0s), 200/200 VUs, 427 complete and 0 interrupted iterations
shift_change_search   [  90% ] 200 VUs  27.0s/30s

running (0m28.0s), 200/200 VUs, 442 complete and 0 interrupted iterations
shift_change_search   [  93% ] 200 VUs  28.0s/30s

running (0m29.0s), 200/200 VUs, 457 complete and 0 interrupted iterations
shift_change_search   [  97% ] 200 VUs  29.0s/30s

running (0m30.0s), 200/200 VUs, 474 complete and 0 interrupted iterations
shift_change_search   [ 100% ] 200 VUs  30.0s/30s

running (0m31.0s), 186/200 VUs, 488 complete and 0 interrupted iterations
shift_change_search ↓ [ 100% ] 200 VUs  30s

running (0m32.0s), 169/200 VUs, 505 complete and 0 interrupted iterations
shift_change_search ↓ [ 100% ] 200 VUs  30s

running (0m33.0s), 154/200 VUs, 520 complete and 0 interrupted iterations
shift_change_search ↓ [ 100% ] 200 VUs  30s

running (0m34.0s), 138/200 VUs, 536 complete and 0 interrupted iterations
shift_change_search ↓ [ 100% ] 200 VUs  30s

running (0m35.0s), 123/200 VUs, 551 complete and 0 interrupted iterations
shift_change_search ↓ [ 100% ] 200 VUs  30s

running (0m36.0s), 108/200 VUs, 566 complete and 0 interrupted iterations
shift_change_search ↓ [ 100% ] 200 VUs  30s

running (0m37.0s), 092/200 VUs, 582 complete and 0 interrupted iterations
shift_change_search ↓ [ 100% ] 200 VUs  30s

running (0m38.0s), 077/200 VUs, 597 complete and 0 interrupted iterations
shift_change_search ↓ [ 100% ] 200 VUs  30s

running (0m39.0s), 062/200 VUs, 612 complete and 0 interrupted iterations
shift_change_search ↓ [ 100% ] 200 VUs  30s

running (0m40.0s), 046/200 VUs, 628 complete and 0 interrupted iterations
shift_change_search ↓ [ 100% ] 200 VUs  30s

running (0m41.0s), 031/200 VUs, 643 complete and 0 interrupted iterations
shift_change_search ↓ [ 100% ] 200 VUs  30s

running (0m42.0s), 018/200 VUs, 656 complete and 0 interrupted iterations
shift_change_search ↓ [ 100% ] 200 VUs  30s

running (0m43.0s), 002/200 VUs, 672 complete and 0 interrupted iterations
shift_change_search ↓ [ 100% ] 200 VUs  30s


  █ THRESHOLDS 

    http_req_duration
    ✗ 'p(95)<300' p(95)=19.36s


  █ TOTAL RESULTS 

    checks_total.......: 674     15.652673/s
    checks_succeeded...: 100.00% 674 out of 674
    checks_failed......: 0.00%   0 out of 674

    ✓ status is 200

    HTTP
    http_req_duration..............: avg=10.82s min=231.06ms med=12.74s max=23.65s p(90)=15.2s  p(95)=19.36s
      { expected_response:true }...: avg=10.82s min=231.06ms med=12.74s max=23.65s p(90)=15.2s  p(95)=19.36s
    http_req_failed................: 0.00%  0 out of 674
    http_reqs......................: 674    15.652673/s

    EXECUTION
    iteration_duration.............: avg=10.83s min=236.72ms med=12.74s max=23.67s p(90)=15.21s p(95)=19.38s
    iterations.....................: 674    15.652673/s
    vus............................: 2      min=2        max=200
    vus_max........................: 200    min=200      max=200

    NETWORK
    data_received..................: 2.5 GB 57 MB/s
    data_sent......................: 70 kB  1.6 kB/s



running (0m43.1s), 000/200 VUs, 674 complete and 0 interrupted iterations
shift_change_search ✓ [ 100% ] 200 VUs  30s
time="2026-08-20T08:15:13+03:00" level=error msg="thresholds on metrics 'http_req_duration' have been crossed"